#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG

class Translation(object):
    
    START_TEXT = """<b>Hey🔥{}BRO!!</b>
<i>Am Just A Advance Auto Filter Bot....😉🔥

Just Add Me To Your Group And Channel And Connect Them And See My Pevers 🔥🔥😝

For More Details Click Help Button Below..
👇👇JOIN 👇👇
@MOVIES_CLUB_GROUP_2

</i>"""    
    
    HELP_TEXT = """
<b><i><u>How To Use Me!?</u></i></b>

<i>
-> Add Me To Any Group And Make Me Admin
-> Add Me To Your Desired Channel
</i>

<b>Bot Commands (Works Only In Groups) :</b>

    -> <code>/add chat_id</code>
                OR                  - To Connect A Group With A Channel (Bot Should Be Admin With Full Previlages In Both Group And Channel)
     <code>/add @Username</code>
     
    -> <code>/del chat_id</code>
                OR                  - To disconnect A Group With A Channel
     <code>/del @Username</code>
     
    -> <code>/delall</code>  - This Command Will Disconnect All Connected Channel With The Group And Deletes All Its File From DB
    
    -> <code>/settings</code> -  This Command Will Display You A Settings Pannel Instance Which Can Be Used To Tweek Bot's Settings Accordingly

            -> <code>Channel</code> - Button Will Show You All The Connected Chats With The Group And Will Show Buttons Correspnding To There Order For Furthur Controls
            
            -> <code>Filter Types</code> - Button Will Show You The 3 Filter Option Available In Bot... Pressing Each Buttons Will Either Enable or Disable Them And This Will Take Into Action As Soon As You Use Them Without The Need Of A Restart

            -> <code>Configure</code> - Button Will Helps You To Change No. of Pages/ Buttons Per Page/ Total Result Without Acutally Editing The Repo... Also It Provide Option To Enable/Disable For Showing Invite Link In Each Results
            
            -> <code>Status</code> - Button Will Shows The Stats Of Your Channel
            
@MOVIES_CLUB_GROUP_2
"""
TELEGRAPH_TEXT = """

𝖧𝖾𝗅𝗉: <u><b>𝖳𝖾𝗅𝖾𝗀𝗋𝖺𝖯𝖧</b></u>

𝖣𝗈 𝖺𝗌 𝗒𝗈𝗎 𝗐𝗂𝗌𝗁 𝗐𝗂𝗍𝗁 𝗍𝖾𝗅𝖾𝗀𝗋𝖺.𝗉𝗁 𝗆𝗈𝖽𝗎𝗅𝖾!

<u><b><u>𝖭𝖮𝖳𝖤:</b></u>

• 𝖨𝖬𝖣𝖻 𝗌𝗁𝗈𝗎𝗅𝖽 𝗁𝖺𝗏𝖾 𝖺𝖽𝗆𝗂𝗇 𝗉𝗋𝗂𝗏𝗂𝗅𝗅𝖺𝗀𝖾.

• 𝖳𝗁𝖾𝗌𝖾 𝖼𝗈𝗆𝗆𝖺𝗇𝖽𝗌 𝗐𝗈𝗋𝗄𝗌 𝗈𝗇 𝖻𝗈𝗍𝗁 𝗉𝗆 𝖺𝗇𝖽 𝗀𝗋𝗈𝗎𝗉.

• 𝖳𝗁𝖾𝗌𝖾 𝖼𝗈𝗆𝗆𝖺𝗇𝖽𝗌 𝖼𝖺𝗇 𝖻𝖾 𝗎𝗌𝖾𝖽 𝖻𝗒 𝖺𝗇𝗒 𝗀𝗋𝗈𝗎𝗉 𝗆𝖾𝗆𝖻𝖾𝗋

<b><u>𝖢𝗈𝗆𝗆𝖺𝗇𝖽𝗌 𝖺𝗇𝖽 𝖴𝗌𝖺𝗀𝖾:</b></u>

• /tgmedia or /tgraph - 𝗎𝗉𝗅𝗈𝖺𝖽 𝗌𝗎𝗉𝗉𝗈𝗋𝗍𝖾𝖽 𝗆𝖾𝖽𝗂𝖺 (𝗐𝗂𝗍𝗁𝗂𝗇 5𝖬𝖡) 𝗍𝗈 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗉𝗁.

"""
FILTER_TEXT = """

<b><u>𝖬𝖺𝗇𝗎𝖺𝗅 𝖥𝗂𝗅𝗍𝖾𝗋</u></b>😍

• 𝖠𝖽𝖽 𝗆𝖾 𝖺𝗌 𝖺𝖽𝗆𝗂𝗇 𝗂𝗇 𝗒𝗈𝗎𝗋 𝗀𝗋𝗈𝗎𝗉 𝖺𝗇𝖽 𝗌𝗍𝖺𝗋𝗍 𝖿𝗂𝗅𝗍𝖾𝗋𝗂𝗇𝗀:

<u><b><u>𝖭𝖮𝖳𝖤:</b></u>

• 𝖣𝗈𝗇𝖫𝖾𝖾 𝗌𝗁𝗈𝗎𝗅𝖽 𝗁𝖺𝗏𝖾 𝖺𝖽𝗆𝗂𝗇 𝗉𝗋𝗂𝗏𝗂𝗅𝗅𝖺𝗀𝖾.

• 𝗈𝗇𝗅𝗒 𝖺𝖽𝗆𝗂𝗇𝗌 𝖼𝖺𝗇 𝖺𝖽𝖽 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 𝗂𝗇 𝖺 𝖼𝗁𝖺𝗍.

• 𝖺𝗅𝖾𝗋𝗍 𝖻𝗎𝗍𝗍𝗈𝗇𝗌 𝗁𝖺𝗏𝖾 𝖺 𝗅𝗂𝗆𝗂𝗍 𝗈𝖿 64 𝖼𝗁𝖺𝗋𝖺𝖼𝗍𝖾𝗋𝗌.

<b><u>𝖢𝗈𝗆𝗆𝖺𝗇𝖽𝗌 𝖺𝗇𝖽 𝖴𝗌𝖺𝗀𝖾:</u></b>

• /addfilter - 𝖠𝖽𝖽 𝖿𝗂𝗅𝗍𝖾𝗋 𝖿𝗈𝗋 𝗇𝖺𝗆𝖾

• /filters - 𝖫𝗂𝗌𝗍 𝖺𝗅𝗅 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 𝗂𝗇 𝖼𝗁𝖺𝗍

• /delfilters - 𝖣𝖾𝗅𝖾𝗍𝖾 𝖿𝗂𝗅𝗍𝖾𝗋

• /delallfilters - 𝖣𝖾𝗅𝖾𝗍𝖾 𝖾𝗇𝗍𝗂𝗋𝖾 𝖿𝗂𝗅𝗍𝖾𝗋𝗌 (𝖦𝗋𝗈𝗎𝗉 𝖮𝗐𝗇𝖾𝗋 𝖮𝗇𝗅𝗒!)

"""
REPORT_TEXT = """

𝖧𝖾𝗅𝗉: <b><u>𝖱𝖾𝗉𝗈𝗋𝗍</u></b>

<b><u>𝖢𝗈𝗆𝗆𝖺𝗇𝖽𝗌:</u></b>

• /report - 𝗋𝖾𝗉𝗅𝗒 𝖺𝗇𝗒 𝖬𝖾𝗌𝗌𝖺𝗀𝖾

• <code>@admin</code> - <code>@𝖺𝖽𝗆𝗂𝗇 𝗒𝗈𝗎𝗋 𝖼𝗈𝗆𝗉𝗅𝖺𝗂𝗇𝗍𝗌</code>

"""

    DART_E_MOJI_1 = "🎯"

    DICE_E_MOJI_2 = "🎲"

    RUN_STRINGS = ["ഇരുട്ട് നിറഞ്ഞ എന്റെ ഈ ജീവിതത്തിലേക്ക് ഒരു തകർച്ചയെ \ \nഓർമ്മിപ്പിക്കാൻ എന്തിന് ഈ ഓട്ടക്കാലണ ആയി നീ വന്നു",

       "നമ്മൾ നമ്മൾ പോലുമറിയാതെ അധോലോകം ആയി മാറിക്കഴിഞ്ഞിരിക്കുന്നു ഷാജിയേട്ടാ...",

       "എന്നെ ചീത്ത വിളിക്കു... വേണമെങ്കിൽ നല്ല ഇടി ഇടിക്കു... പക്ഷെ ഉപദേശിക്കരുത്.....",

       "ഓ ബ്ലഡി ഗ്രാമവാസീസ്!",

       "സീ മാഗ്ഗി ഐ ആം ഗോയിങ് ടു പേ ദി ബിൽ.",

       "പോരുന്നോ എന്റെ കൂടെ!",

       "തള്ളെ കലിപ്പ് തീരണില്ലല്ലോ!!",

       "ശബരിമല ശാസ്താവാണെ ഹരിഹരസുതനാണെ ഇത് ചെയ്തവനെ ഞാൻ പൂട്ടും നല്ല മണിച്ചിത്രത്താഴിട്ട് പൂട്ടും .",

       "ഞാൻ കണ്ടു...!! കിണ്ടി... കിണ്ടി...!",

       "മോന്തയ്ക്കിട്ട് കൊടുത്തിട്ട് ഒന്ന് എടുത്ത് കാണിച്ചുകൊടുക്ക് അപ്പോൾ കാണും ISI മാർക്ക് ",

       "ഡേവീസേട്ട, കിങ്ഫിഷറിണ്ടാ... ചിൽഡ്...! .",

       "പാതിരാത്രിക്ക് നിന്റെ അച്ഛൻ ഉണ്ടാക്കി വെച്ചിരിക്കുന്നോ പൊറോട്ടയും ചിക്കനും....",

       "ഇത് ഞങ്ങളുടെ പണിസാധനങ്ങളാ രാജാവേ.",

       "കളിക്കല്ലേ കളിച്ചാൽ ഞാൻ തീറ്റിക്കുമെ പുളിമാങ്ങ....",

       "മ്മക്ക് ഓരോ ബിയറാ കാച്ചിയാലോ...",

       "ഓ പിന്നെ നീ ഒക്കെ പ്രേമിക്കുമ്പോൾ അത് പ്രണയം.... നമ്മൾ ഒക്കെ പ്രേമിക്കുമ്പോൾ അത് കമ്പി...",

       "കള്ളടിക്കുന്നവനല്ലേ കരിമീനിന്റെ സ്വാദറിയു.....",

       "ഡാ വിജയാ നമുക്കെന്താ ഈ ബുദ്ധി നേരത്തെ തോന്നാതിരുന്നത്...!",

       "ഇത്രേം കാലം എവിടെ ആയിരുന്നു....!",

       "ദൈവമേ എന്നെ മാത്രം രക്ഷിക്കണേ....",

       "എനിക്കറിയാം ഇവന്റെ അച്ഛന്റെ പേര് ഭവാനിയമ്മ എന്നാ....",

       "ഡാ ദാസാ... ഏതാ ഈ അലവലാതി.....",

       "ഉപ്പുമാവിന്റെ ഇംഗ്ലീഷ് സാൾട് മംഗോ ട്രീ.....",

       "മക്കളെ.. രാജസ്ഥാൻ മരുഭൂമിയിലേക്ക് മണല് കയറ്റിവിടാൻ നോക്കല്ലേ.....",

       "നിന്റെ അച്ഛനാടാ പോൾ ബാർബർ....",

       "കാർ എൻജിൻ ഔട്ട് കംപ്ലീറ്റ്‌ലി.....",

       "ഇത് കണ്ണോ അതോ കാന്തമോ...",

       "നാലാമത്തെ പെഗ്ഗിൽ ഐസ്‌ക്യൂബ്സ് വീഴുന്നതിനു മുൻപ് ഞാൻ അവിടെ എത്തും.....",

       "അവളെ ഓർത്ത് കുടിച്ച കല്ലും നനഞ്ഞ മഴയും വേസ്റ്റ്....",

       "എന്നോട് പറ ഐ ലവ് യൂ ന്ന്....",

       "അല്ല ഇതാര് വാര്യംപിള്ളിയിലെ മീനാക്ഷി അല്ലയോ... എന്താ മോളെ സ്കൂട്ടറില്.... "

    ]
    
    ABOUT_TEXT = """<b>➥ Name</b> : <code> Auto Filter Bot</code>
    
<b>➥ Creator</b> : <b><i><a href="https://t.me/althaf_mr">althaf_mr</a></i></b>

<b>➥ Language</b> : <code>Python3</code>

<b>➥ Library</b> : <i><a href="https://docs.pyrogram.org">Pyrogram Asyncio 1.13.0 </a></i>

<b>➥ Source Code</b> : <i><a href="https://github.com/MOVIESCLUBmy/Auto-Filter-Bot-V2">Click Me</a></i>
"""
